# IdeaStatiCa.ConnectionApi.Model.ConWeldOperation

## Properties

Name | Type | Description | Notes
------------ | ------------- | ------------- | -------------
**Placement** | **ConWeldPlacement** |  | [optional]
**FirstMemberOrPlate** | **ConConnectedItem** |  | [optional]
**FirstPlateEdgeIndex** | **List&lt;int&gt;** |  | [optional]
**SecondMemberOrPlate** | **ConConnectedItem** |  | [optional]
**SecondPlateEdgeIndex** | **int** |  | [optional]
**Weld** | **ConWeldData** |  | [optional]
**IsImported** | **bool** |  | [optional]
**OperationType** | **string** |  | [optional]
**Id** | **int** |  | [optional]
**Name** | **string** |  | [optional]
**Active** | **bool** |  | [optional]

[[Back to Model list]](../README.md#documentation-for-models) [[Back to API list]](../README.md#documentation-for-api-endpoints) [[Back to README]](../README.md)